<?php
// +----------------------------------------------------------------------
// | LengdoFrame - 整站公用配置库
// +----------------------------------------------------------------------
// | Copyright (c) 2009 http://lengdo.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: Yangfan Dai <dmlk31@163.com>
// +----------------------------------------------------------------------
// $Id$


/* ----------------------------------------------------------------------- */
// - 数据库登陆信息
/* ----------------------------------------------------------------------- */
$_CFG['dbhost'] = 'localhost';    //数据库服务器
$_CFG['dbname'] = 'lengdoframe';  //数据库名称
$_CFG['dbuser'] = 'root';         //数据库登陆帐号
$_CFG['dbpass'] = '';             //数据库登陆密码
$_CFG['tblpre'] = '';             //数据表名称前辍


/* ----------------------------------------------------------------------- */
// - 自定义目录路径信息(保留末尾斜杠)
/* ----------------------------------------------------------------------- */

/* 上传的文件夹 */
// $_CFG['DIR_UPLOAD'] = $_CFG['DIR_ROOT'] . 'upload/';
// $_CFG['URL_UPLOAD'] = $_CFG['URL_ROOT'] . 'upload/';

/* JS编辑器文件夹 */
// $_CFG['DIR_JSEDITOR_UPLOAD'] = $_CFG['DIR_ROOT'] . 'upload/jseditor/';
// $_CFG['URL_JSEDITOR_UPLOAD'] = $_CFG['URL_ROOT'] . 'upload/jseditor/';
// $_CFG['URL_JSEDITOR_FOLDER'] = $_CFG['URL_ROOT'] . 'js/fckeditor/';
?>